openfoam_3d/hilldata_simpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.00;

vertices
(
    (0.0000 0.0000 0.0000)
    (3680.0000 0.0000 0.0000)
    (3680.0000 3261.9844 0.0000)
    (0.0000 3261.9844 0.0000)
    (0.0000 0.0000 595.9345)
    (3680.0000 0.0000 595.9345)
    (3680.0000 3261.9844 595.9345)
    (0.0000 3261.9844 595.9345)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (128 128 64)
    simpleGrading
    (
        1
        1
        1
    )
);

edges
(
);

boundary
(
    north_face
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    west_face
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    east_face
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    south_face
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    minZ
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    maxZ
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }     
);

mergePatchPairs
(
);

// ************************************************************************* //
