openfoam_3d/hilldata_simpleFoam/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
	}
    
    outlet
    {
        type            totalPressure;
        value           uniform 0;
		gamma           1.4;
		p0              uniform 0;
	}
    
    wall
    {
        type            zeroGradient;
    }
    
    #includeEtc "caseDicts/setConstraintTypes"    
}


// ************************************************************************* //
